app/Controllers/Home.php

    public function index()
{
    // Load your custom dashboard view with dynamic data
    $itemModel = new \App\Models\ItemModel();

    $data = [
        'pendingCount' => $itemModel->where('status', 'pending')->countAllResults(),
        'claimedCount' => $itemModel->where('status', 'claimed')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `status` = 'claimed'