app/Controllers/ItemController.php

    public function index()
    {
        $status = $this->request->getGet('status');
        if ($status && in_array($status, ['pending', 'claimed'])) {
            $items = $this->itemModel->where('status', $status)->orderBy('created_at', 'desc')->findAll();
        } else {
            $items = $this->itemModel->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `items`
WHERE `status` = 'pending'
ORDER BY `created_at` DESC
SELECT *
FROM `items`
ORDER BY `created_at` DESC

    public function edit($id = null)
    {
        $item = $this->itemModel->find($id);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '1'

    public function delete($id = null)
    {
        $item = $this->itemModel->find($id);
        if ($item) {
            if ($item['image'] && file_exists($this->uploadPath . $item['image'])) {
                unlink($this->uploadPath . $item['image']);
            }
            $this->itemModel->delete($id);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '1'
DELETE FROM `items`
WHERE `id` IN ('1')

    public function show($id = null)
    {
        $item = $this->itemModel->find($id);
---
SELECT *
FROM `items`
WHERE `items`.`id` = '1'